# LowerLevelId Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
MassZone..::..LowerLevelId Property
MassZone Class See Also
---
The bottom level defining the MassZone.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ElementId LowerLevelId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LowerLevelId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ LowerLevelId {
	ElementId^ get ();
}
```

# See Also
MassZone Class
Autodesk.Revit.DB.Analysis Namespace